In [14]:
import pandas as pd

In [15]:
cars=pd.read_csv("cars.csv")

In [16]:
cars

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,23,28,16845
201,-1,95,volvo,gas,sedan,rwd,front,68.8,55.5,ohc,141,160,19,25,19045
202,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohcv,173,134,18,23,21485
203,-1,95,volvo,diesel,sedan,rwd,front,68.9,55.5,ohc,145,106,26,27,22470
204,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,19,25,22625

In [17]:
cars[cars["price"]==45400]

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
74,1,?,mercedes-benz,gas,hardtop,rwd,front,72.0,55.4,ohcv,304,184,14,16,45400

In [18]:
cars[cars["price"]==cars["price"].max()]

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
74,1,?,mercedes-benz,gas,hardtop,rwd,front,72.0,55.4,ohcv,304,184,14,16,45400

In [19]:
cars[cars["price"]==cars["price"].max()]["make"]

74    mercedes-benz
Name: make, dtype: object

In [20]:
cars["price"].idxmax()

74

In [21]:
cars.iloc[74]["make"]

'mercedes-benz'

In [9]:
#Which car has lowest city mileage
#Which engine-type has highest highway mileage
#Which body-style car is the cheapest

In [10]:
cars["city.mpg"].idxmin()

KeyError: 'city.mpg'

In [22]:
cars["city.mpg"].min()

KeyError: 'city.mpg'

In [23]:
cars["city-mpg"].min()

13

In [24]:
cars["city-mpg"].idxmin()

49

In [25]:
cars.iloc[49]["make"]

'jaguar'

In [26]:
cars["highway-mpg"].idxmax()

30

cars.iloc[30]["engine-type"]

In [27]:
cars.iloc[30]["engine-type"]

'ohc'

In [28]:
cars["price"].idxmin()

138

In [29]:
cars.iloc[138]["body-style"]

'hatchback'

In [30]:
#categorcal column

In [31]:
cars["make"].unique()

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mercury',
       'mitsubishi', 'nissan', 'peugot', 'plymouth', 'porsche', 'renault',
       'saab', 'subaru', 'toyota', 'volkswagen', 'volvo'], dtype=object)

In [32]:
cars["make"].value_counts()

toyota           32
nissan           18
mazda            17
honda            13
mitsubishi       13
subaru           12
volkswagen       12
peugot           11
volvo            11
dodge             9
bmw               8
mercedes-benz     8
audi              7
plymouth          7
saab              6
porsche           5
isuzu             4
alfa-romero       3
chevrolet         3
jaguar            3
renault           2
mercury           1
Name: make, dtype: int64

In [33]:
# what are the different fuel-types, which one is used the most?
# which body-style cars are very less
# how many engine-types and which is less used

In [34]:
cars["fuel-type"].value_counts()

gas       185
diesel     20
Name: fuel-type, dtype: int64

In [35]:
cars["fuel-type"].value_counts().head(1)

gas    185
Name: fuel-type, dtype: int64

In [36]:
cars["fuel-type"].value_counts().tail(1)

diesel    20
Name: fuel-type, dtype: int64

In [37]:
cars["body-style"].value_counts().tail(1)

convertible    6
Name: body-style, dtype: int64

In [38]:
cars["engine-type"].value_counts().tail(1)

dohcv    1
Name: engine-type, dtype: int64

#Groupby function

In [39]:
mydict = {"name":["Jack","Jill","Jack","Jill"],"subject":["ML","ML","PY","PY"],"marks":[80,90,96,84]}

In [40]:
mydict

{'name': ['Jack', 'Jill', 'Jack', 'Jill'],
 'subject': ['ML', 'ML', 'PY', 'PY'],
 'marks': [80, 90, 96, 84]}

In [41]:
df = pd.Dataframe(mydict)

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [42]:
df = pd.DataFrame(mydict)

In [43]:
df

   name subject  marks
0  Jack      ML     80
1  Jill      ML     90
2  Jack      PY     96
3  Jill      PY     84

In [44]:
df.groupby("name").groups

{'Jack': Int64Index([0, 2], dtype='int64'),
 'Jill': Int64Index([1, 3], dtype='int64')}

In [45]:
df.groupby("name")["marks"].sum()

name
Jack    176
Jill    174
Name: marks, dtype: int64

In [46]:
df.groupby("name")["marks"].mean()

name
Jack    88
Jill    87
Name: marks, dtype: int64

In [47]:
# What is the average city-mileage for each manufacturer ?

# What is the average price for each body-style of car ?
# What is the average highway-mpg for each engine-style ?
# What is the average price for each make of the car ?

In [48]:
cars.groupby("make")["city.mpg"].mean()

KeyError: 'Column not found: city.mpg'

In [49]:
cars.groupby("make")["city-mpg"].mean()

make
alfa-romero      20.333333
audi             18.857143
bmw              19.375000
chevrolet        41.000000
dodge            28.000000
honda            30.384615
isuzu            31.000000
jaguar           14.333333
mazda            25.705882
mercedes-benz    18.500000
mercury          19.000000
mitsubishi       24.923077
nissan           27.000000
peugot           22.454545
plymouth         28.142857
porsche          17.400000
renault          23.000000
saab             20.333333
subaru           26.333333
toyota           27.500000
volkswagen       28.583333
volvo            21.181818
Name: city-mpg, dtype: float64

In [50]:
cars.groupby("body-style")["price"].mean()

body-style
convertible    21890.500000
hardtop        22208.500000
hatchback      10015.800000
sedan          14502.260417
wagon          12371.960000
Name: price, dtype: float64

In [51]:
cars.groupby("engine-type")["highway-mpg"].mean()

engine-type
dohc     24.833333
dohcv    28.000000
l        28.833333
ohc      32.567568
ohcf     29.600000
ohcv     21.230769
rotor    23.000000
Name: highway-mpg, dtype: float64

In [52]:
cars.groupby("make")["price"].mean()

make
alfa-romero      15498.333333
audi             17022.142857
bmw              26118.750000
chevrolet         6007.000000
dodge             7875.444444
honda             8184.692308
isuzu            12708.250000
jaguar           34600.000000
mazda            10652.882353
mercedes-benz    33647.000000
mercury          16503.000000
mitsubishi        9239.769231
nissan           10415.666667
peugot           15489.090909
plymouth          7963.428571
porsche          27520.400000
renault           9595.000000
saab             15223.333333
subaru            8541.250000
toyota            9885.812500
volkswagen       10077.500000
volvo            18063.181818
Name: price, dtype: float64

In [53]:
#What is the average price for each make of the car ?

#cars.groupby("make")["price"].mean().sort_values()

In [54]:
cars.groupby("make")["price"].mean().sort_values(ascending=False)

make
jaguar           34600.000000
mercedes-benz    33647.000000
porsche          27520.400000
bmw              26118.750000
volvo            18063.181818
audi             17022.142857
mercury          16503.000000
alfa-romero      15498.333333
peugot           15489.090909
saab             15223.333333
isuzu            12708.250000
mazda            10652.882353
nissan           10415.666667
volkswagen       10077.500000
toyota            9885.812500
renault           9595.000000
mitsubishi        9239.769231
subaru            8541.250000
honda             8184.692308
plymouth          7963.428571
dodge             7875.444444
chevrolet         6007.000000
Name: price, dtype: float64

In [55]:
# Which make has the highest average price ?

In [56]:
cars.groupby("make")["price"].mean().idxmax()

'jaguar'

In [57]:
# Which body-style has minimum average city-mpg

In [58]:
cars.groupby("body-style")["city-mpg"].mean().idxmin()

'convertible'

In [59]:
# Which engine-type has lowest average highway-mpg?

In [60]:
cars.groupby("engine-type")["highway-mpg"].mean().idxmin()

'ohcv'

In [61]:
#multiple categorygroups

In [62]:
cars.groupby(["body-style","fuel-type"])["price"].mean()

body-style   fuel-type
convertible  gas          21890.500000
hardtop      diesel       28176.000000
             gas          21356.000000
hatchback    diesel        7788.000000
             gas          10048.086957
sedan        diesel       14774.400000
             gas          14451.864198
wagon        diesel       19727.666667
             gas          11368.909091
Name: price, dtype: float64

In [63]:
newdict = {"name":["john","jack","jill"],"maths":[40,50,60],"science":[45,55,65]}

In [64]:
newdict

{'name': ['john', 'jack', 'jill'],
 'maths': [40, 50, 60],
 'science': [45, 55, 65]}

In [65]:
df=pd.Dataframe(newdict)

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [66]:
df = pd.DataFrame(newdict)

In [67]:
df

   name  maths  science
0  john     40       45
1  jack     50       55
2  jill     60       65

In [68]:
# how to add new rows and new column

In [69]:
df["total"]=df["maths"]+df["science"]

In [70]:
df

   name  maths  science  total
0  john     40       45     85
1  jack     50       55    105
2  jill     60       65    125

In [71]:
grade=pd.Series(["B","B","A"],name="grade")

In [72]:
pd.concat([df,grade],axis=1)

   name  maths  science  total grade
0  john     40       45     85     B
1  jack     50       55    105     B
2  jill     60       65    125     A

In [73]:
#add newrow to data frame

In [75]:
row=pd.Series(["JAmes",70,5,120,"A"],index=["name","maths","science","total","grade",])

In [76]:
row

name       JAmes
maths         70
science        5
total        120
grade          A
dtype: object

In [81]:
df=df.append(row,ignore_index=True)

In [82]:
df

    name  maths  science  total grade
0   john     40       45     85   NaN
1   jack     50       55    105   NaN
2   jill     60       65    125   NaN
3  JAmes     70        5    120     A

In [83]:
players1 = {"player":["bkumar","hardik","ashwin","bumrah"],"wickets":[120,100,98,150]}
players2 = {"player":["sehwag","hardik","ashwin","sachin"],"runs":[8000,6000,5500,9500]}

In [84]:
batsman = pd.DataFrame(players2)
bowler = pd.DataFrame(players1)

In [85]:
batsman

   player  runs
0  sehwag  8000
1  hardik  6000
2  ashwin  5500
3  sachin  9500

In [86]:
bowler

   player  wickets
0  bkumar      120
1  hardik      100
2  ashwin       98
3  bumrah      150

In [87]:
#inner merge
pd.merge(batsman,bowler,on="player")

   player  runs  wickets
0  hardik  6000      100
1  ashwin  5500       98

In [88]:
#outer merge
pd.merge(batsman,bowler,on="player",how="outer")

   player    runs  wickets
0  sehwag  8000.0      NaN
1  hardik  6000.0    100.0
2  ashwin  5500.0     98.0
3  sachin  9500.0      NaN
4  bkumar     NaN    120.0
5  bumrah     NaN    150.0

In [89]:
#right merge
pd.merge(batsman,bowler,on="player",how="right")

   player    runs  wickets
0  hardik  6000.0      100
1  ashwin  5500.0       98
2  bkumar     NaN      120
3  bumrah     NaN      150

In [90]:
pd.merge(batsman,bowler,on="player",how="left")

   player  runs  wickets
0  sehwag  8000      NaN
1  hardik  6000    100.0
2  ashwin  5500     98.0
3  sachin  9500      NaN